# Задача 32: Определить индексы элементов массива (списка),
# значения которых принадлежат заданному диапазону (т.е. не
# меньше заданного минимума и не больше заданного
# максимума
# Ввод: [-5, 9, 0, 3, -1, -2, 1,  4, -2, 10, 2, 0, -9, 8, 10, -9,  0, -5, -5, 7]
# Вывод: [1, 9, 13, 14, 19]
list_1 = [-2, -1, 0, 1, 2, 3, 4]
min_1 = int(input("введите нижний предел: "))
max_1 = int(input("введите верхний предел: "))
index_list = []
if min_1<max_1:
    for i in range(len(list_1)):
        if list_1[i]>=min_1 and list_1[i]<=max_1:
            index_list.append(i)
    print(index_list)
else:
    print("min > max - folse")
